[
    {
        "id": 0,
        "jobTitle": "Customer Solution Analyst",
        "jobRouter": "customer-solution-analyst",
        "jobDesc": "The Customer Solution Analyst role provides a gateway to develop into sophisticated trading professionals. Those that excel in this challenging role are provided with the opportunity to develop their career with a New Zealand’s leader in the rapidly expanding FX/CFD trading industry.\n The Customer Solution Analyst uses a consultative, passive-sales approach on all leads. The Customer Solution Analyst will contact prospective clients to facilitate the learning process and drive the sales of the Company’s products and services.",
        "jobResponsibilities": "Drive the company's growth efforts for the South Korean business \nProspect new leads, explain the features and benefits of the CJC Market’s products and services \nFacilitate the onboarding of new clients from South Korea \nBuild and maintain relationships with existing clients and oversee growth of organic business as it relates to new accounts and customer equity \nMaintain regular communication with numerous offices and colleagues from around the world showing an ability to work non-traditional hours when appropriate \nExecute an organized, efficient and structured communication process through documents \nClient KYC update and assist on local W/D \nLiaise with partnership team and IBs to update client status \nFollow up with daily updated partner’s complex relationship trees \nActively manage FX/CFD community via paid, earned and owned media",
        "jobQualifications": "Ideally, bachelor's degree, with minimum 2 years of business experience \nPreference given to those who already understand the needs and trends of the online trading community within South Korea \nNative business level written and verbal communication skills in Korean \nStrong written and verbal communication skills in English or Chinese \nKnowledge of the FX/CFDs industry would be beneficial \nComputer Proficient - Must have knowledge of Adobe Acrobat, Microsoft Office, and Internet \nClient oriented mindset \nDetail-oriented with a high level of organizational skills; \nAble to multi-task and meet daily benchmarks/ deadlines in a fast-paced and dynamic business environment",
        "jobNotice": "In your CV, desired salary information MUST be included (Current position doesn’t support expenses related to residential, interview and other miscellaneous so if your current position support above subsidiary expenses please account into desired salary) \nContactable number MUST be included in CV (Recruitment guide will be given out through line or email) \nCurrent position is based in China, Shanghai, this position doesn’t support relocation cost \nCandidate needs to be eligible to issue Chinese Z-Visa (Criminal record, two years of professional experience) \nIf candidate is not eligible to issue Chinese Z-Visa, CJC will consult the visa agency for possibility of issuance \nFalse information on CVs may cause cancellation of recruitment \nMUST submit Korean version CV/Resume \nMUST submit English or Chinese version CV/Resume \nAll 3 languages speaker please submit 3 CV/Resume",
        "jobExtra": "MSC (MSC) is one of the New Zealand’s leading derivatives issuer. Whether you are looking for a first job or taking the next step in your career, we offer many ways for you to realize your ambitions. Come and work with us and you'll have opportunities to make connections across Asia Pacific regions and help build the broker for the future. \nThe candidate must provide his/her Korean and English or Chinese CV via email at kr.support@cjcmarkets.com"
    },
    {
        "id": 1,
        "jobTitle": "Partnership Analyst/Associate",
        "jobRouter": "partnership-analyst-associate",
        "jobDesc": "The Partnership Analyst/Associate role provides a gateway to develop into sophisticated trading professionals. Those that excel in this challenging role are provided with the opportunity to develop their career with a New Zealand’s leader in the rapidly expanding FX/CFD trading industry. \nThe Partnership Analyst/Associate role uses an active and persuasive-sales approach on finding, building and closing new partnership deals in South Korea but not limited to the region. The Partnership Analyst/Associate will contact prospective partners to facilitate the mutual success of the company and the partners.",
        "jobResponsibilities": "Drive the company's growth efforts for the South Korean business \nAble to work remotely while travelling to required region (80% travel) \nProspect new partnerships, research and analyze partner’s business model to provide betterment deals with MSC \nLiaise with customer solution departments to facilitate the onboarding of partner’s new clients from South Korea \nBuild and maintain relationships with existing partners and monitor competitor in the region \nMaintain regular communication with numerous offices and colleagues from around the world showing an ability to work non-traditional hours when appropriate \nExecute an organized, efficient and structured communication process through documents \nBeget planning for sales activity under profit model \nHold regular economic seminars in the region as a speaker and with partners \nDaily update partner’s complex relationship trees \nActively manage FX/CFD community via paid, earned and owned media \nClosely monitor evolving South Korea’s FX/CFD scene and propose new paid and earned media opportunity to PR/Marketing team",
        "jobQualifications": "Ideally, bachelor's degree, with minimum 2 years of business experience \nMust have prior FX/CFD experience if you are applying for Associate position \nMust have prior trading FX/CFD experience if you are applying for Analyst position \nNative business level written and verbal communication skills in Korean \nStrong written and verbal communication skills in English or Chinese \nComputer Proficient - Must have knowledge of Adobe Acrobat, Microsoft Office, and Internet \nOutgoing, presentable, high level of organizational skills and outstanding interpersonal skills",
        "jobNotice": "In your CV, desired salary information MUST be included (Current position doesn’t support expenses related to residential, interview and other miscellaneous so if your current position support above subsidiary expenses please account into desired salary) \nContactable number MUST be included in CV (Recruitment guide will be given out through line or email) \nCurrent position is based in China, Shanghai, this position doesn’t support relocation cost \nCandidate needs to be eligible to issue Chinese Z-Visa (Criminal record, two years of professional experience) \nIf candidate is not eligible to issue Chinese Z-Visa, CJC will consult the visa agency for possibility of issuance \nFalse information on CVs may cause cancellation of recruitment \nMUST submit Korean version CV/Resume \nMUST submit English or Chinese version CV/Resume \nAll 3 languages speaker please submit 3 CV/Resume",
        "jobExtra": "MSC (MSC) is one of the New Zealand’s leading derivatives issuer. Whether you are looking for a first job or taking the next step in your career, we offer many ways for you to realize your ambitions. Come and work with us and you'll have opportunities to make connections across Asia Pacific regions and help build the broker for the future. \nThe candidate must provide his/her Korean and English or Chinese CV via email at kr.support@cjcmarkets.com"
    },
    {
        "id": 2,
        "jobTitle": "PR/Marketing Analyst/Associate",
        "jobRouter": "pr-marketing-analyst-associate",
        "jobDesc": "The PR/Marketing Analyst role provides a gateway to develop into sophisticated trading professionals. Those that excel in this challenging role are provided with the opportunity to develop their career with a New Zealand’s leader in the rapidly expanding FX/CFD trading industry. \nThe PR/Marketing Analyst/Associate uses an online marketing skill to develop new leads in South Korea. The PR/Marketing Analyst/Associate will contact local medias and marketing agency to perform paid, earned and owned media.",
        "jobResponsibilities": "Drive the company's growth efforts for the South Korean business \nGenerate new leads through CJC Market’s owned media \nPropose and persuade HQ PR/Marketing budget team through data driven marketing strategy to perform paid and earned media \nCast local market analysts to be on the owned media and local media agency of MSC \nMarket, economic and company related contents creation \nCreation of requested document from Customer Solutions and Partnership teams \nLiaise with Partnership teams to support content and online marketing for partners \nTranslate market and economic articles from Chinese to Korean or English to Korean",
        "jobQualifications": "Ideally, bachelor's degree, with minimum 2 years of business experience \nPreference given to who has experience in online marketing agency industry in South Korea \nKeyword and exposure landscape logic understanding in Google, Youtube, Naver, Kakao, Facebook \nNative business level written and verbal communication skills in Korean \nStrong written and verbal communication skills in English or Chinese \nKnowledge of the FX/CFDs industry would be beneficial \nComputer Proficient - Must have knowledge of Adobe Acrobat, Microsoft Office, and Internet \nAble to use design tools and video editing tools \nAble to concurrent Market Analyst role will be a huge plus \nAble to multi-task and meet daily benchmarks/deadlines in a fast-paced and dynamic business environment",
        "jobNotice": "In your CV, desired salary information MUST be included (Current position doesn’t support expenses related to residential, interview and other miscellaneous so if your current position support above subsidiary expenses please account into desired salary) \nContactable number MUST be included in CV (Recruitment guide will be given out through line or email) \nCurrent position is based in China, Shanghai, this position doesn’t support relocation cost \nCandidate needs to be eligible to issue Chinese Z-Visa (Criminal record, two years of professional experience) \nIf candidate is not eligible to issue Chinese Z-Visa, CJC will consult the visa agency for possibility of issuance \nFalse information on CVs may cause cancellation of recruitment \nMUST submit Korean version CV/Resume \nMUST submit English or Chinese version CV/Resume \nAll 3 languages speaker please submit 3 CV/Resume",
        "jobExtra": "MSC (MSC) is one of the New Zealand’s leading derivatives issuer. Whether you are looking for a first job or taking the next step in your career, we offer many ways for you to realize your ambitions. Come and work with us and you'll have opportunities to make connections across Asia Pacific regions and help build the broker for the future. \nThe candidate must provide his/her Korean and English or Chinese CV via email at kr.support@cjcmarkets.com"
    }
]
